backend/controllers/HoaDonController.php

SELECT * FROM `qlcvsd_gia_dien`
SELECT * FROM `qlcvsd_danh_muc` WHERE parent_id is null and active=1
SELECT * FROM `qlcvsd_gia_nuoc`
SELECT * FROM `qlcvsd_thiet_lap_gia`
---
    public function actionCreate()
    {
        $giaDienIDs = ArrayHelper::map(
            \backend\models\GiaDien::find()->all(),
            'id',
            function ($model) {
                return Yii::$app->formatter->asDate($model->ngay_bat_dau, 'php:d/m/Y');
            }
        );
        $toanhaids = ArrayHelper::map(
            \backend\models\DanhMuc::find()->andWhere('parent_id is null and active=1')->all(),
            'id',
            'name'
        );
        $giaNuocs = ArrayHelper::map(
            \backend\models\GiaNuoc::find()->all(),
            'id',
            'name'
        );
        $dichVus = ThietLapGia::find()->all();

SELECT * FROM `qlcvsd_quan_ly_hoa_don` WHERE (`trang_thai` != 'Hoàn thành') AND (`thang`=5) AND (`nam`=2025) AND (`active`=1) AND (`parent_id`='9') AND (`loai_hop_dong`='thang')
---
    public function actionGetHoaDon()
    {
        $thang = intval($_POST['thang']);
        $nam = intval($_POST['nam']);
        $kieuTienNuoc = $_POST['kieuTienNuoc'];
        $typeHienThi = 'hien_thi';

        if (intval($thang) == (int)date('m')-1 && intval($nam) == (int)date('Y') ||
            (intval($thang) == 12 && intval($nam) == (int)date('Y') - 1 && (int)date('m') == 1) ||
            intval($thang) == (int)date('m') && intval($nam) == (int)date('Y') ||
            intval($thang) == (int)date('m') + 1 && intval($nam) == (int)date('Y') ||
            intval($thang) == 1 && intval($nam) == (int)date('Y') + 1){
            $typeHienThi = 'so_nuoc';
            if ($kieuTienNuoc == 'so_nguoi'){
                $typeHienThi = 'so_nguoi';
            }
        }

        $toa_nha_id = $_POST['toa_nha_id'];
        $hoaDons = QuanLyHoaDon::find()
            ->andFilterWhere(['!=', 'trang_thai', HoaDon::HOAN_THANH])
            ->andFilterWhere(['thang' => $thang])
            ->andFilterWhere(['nam' => $nam])
            ->andFilterWhere(['active' => 1])
            ->andFilterWhere(['parent_id'=> $toa_nha_id])
            ->andFilterWhere(['loai_hop_dong' => 'thang'])->all();

SELECT * FROM `qlcvsd_danh_muc` WHERE `id`=10
---
        foreach ($hoaDons as $hoaDon){
            $hang = [];
            $tongTien = $hoaDon->tien_phong;
            $phong = DanhMuc::findOne($hoaDon->phong_id);

SELECT * FROM `qlcvsd_chi_tiet_hoa_don` WHERE (`hoa_don_id`=1537) AND (`dich_vu_id`=2)
SELECT * FROM `qlcvsd_chi_tiet_hoa_don` WHERE `hoa_don_id`=1537
SELECT * FROM `qlcvsd_thiet_lap_gia` WHERE `id`=2
---
            $hang['so_nguoi'] = $hoaDon->so_nguoi;
            $hang['phong'] = $phong->name;

            $hang['anhDien'] = ChiTietHoaDon::find()
            ->andFilterWhere(['hoa_don_id'=>$hoaDon->id])
            ->andFilterWhere(['dich_vu_id'=>2])->one()->anh;

            $chiTiets = ChiTietHoaDon::findAll(['hoa_don_id'=>$hoaDon->id]);
            foreach ($chiTiets as $chiTiet){
                $name = ThietLapGia::findOne($chiTiet->dich_vu_id)->name;

SELECT * FROM `qlcvsd_giao_dich` WHERE (`active`=1) AND (`hoa_don_id`=1537)
---
            $hang['da_thanh_toan'] = number_format($hoaDon->da_thanh_toan, 0, ',', '.');
            $hang['tien_nuoc'] = number_format($hoaDon->so_nguoi * $phong->gia_nuoc_nguoi, 0, ',', '.');
            $trangThai = 'Chưa tạo giao dịch';
            $giaoDichs = GiaoDich::find()
            ->andFilterWhere(['active' => 1])
            ->andFilterWhere(['hoa_don_id'=>$hoaDon->id])->all();

SELECT * FROM `qlcvsd_thiet_lap_gia`
---
        Yii::$app->response->format = \yii\web\Response::FORMAT_JSON;
        return [
            'success' => true,
            'content' => $this->renderPartial('danh-sach', [
                'dichVus' => ThietLapGia::find()->all(),
                'results' => $result,
                'typeHienThi' => $typeHienThi
            ]),

SELECT * FROM `qlcvsd_quan_ly_o_cung` WHERE `hoa_don_id`='1537'
---
    public function actionGetOCung()
    {
        $chiTiet = QuanLyOCung::find()
            ->andFilterWhere(['hoa_don_id'=>$_POST['id']])->all();